In [36]:
import pandas as pd

company_items = [
    { "Year": 1990, "Name": "Alice", "Department": "HR", "Age": 25, "Salary": 50000 },
    { "Year": 1990, "Name": "Bob", "Department": "RD", "Age": 30, "Salary": 48000 },
    { "Year": 1990, "Name": "Charlie", "Department": "Admin", "Age": 45, "Salary": 55000 },
    { "Year": 1991, "Name": "Alice", "Department": "HR", "Age": 26, "Salary": 52000 },
    { "Year": 1991, "Name": "Bob", "Department": "RD", "Age": 31, "Salary": 50000 },
    { "Year": 1991, "Name": "Charlie", "Department": "Admin", "Age": 46, "Salary": 60000 },
    { "Year": 1992, "Name": "Alice", "Department": "Admin", "Age": 27, "Salary": 60000 },
    { "Year": 1992, "Name": "Bob", "Department": "RD", "Age": 32, "Salary": 52000 },
    { "Year": 1992, "Name": "Charlie", "Department": "Admin", "Age": 28, "Salary": 62000 }
    ]
company_df = pd.DataFrame(company_items)
company_df

   Age Department     Name  Salary  Year
0   25         HR    Alice   50000  1990
1   30         RD      Bob   48000  1990
2   45      Admin  Charlie   55000  1990
3   26         HR    Alice   52000  1991
4   31         RD      Bob   50000  1991
5   46      Admin  Charlie   60000  1991
6   27      Admin    Alice   60000  1992
7   32         RD      Bob   52000  1992
8   28      Admin  Charlie   62000  1992

In [37]:
# How much money company spent in salaries each year
company_df.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [38]:
company_df.groupby(['Year','Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64